Revit 2024 API
GroupTypeId.Fitting Property
 Fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId Fitting { get; }
Visual Basic
Public Shared ReadOnly Property Fitting As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Fitting {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace